## EDA and Preprocessing

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import missingno as msno
%matplotlib inline

import warnings
warnings.filterwarnings('ignore')

### Read CSV

In [2]:
loan_df = pd.read_csv('./Datasets/Loan_data.csv')

In [3]:
loan_df.shape

(1000, 29)

In [4]:
loan_df.columns

Index(['OBS.', 'CHK_ACCT', 'DURATION', 'HISTORY', 'CAR', 'FURNITURE',
       'RADIO.TV', 'EDUCATION', 'RETRAINING', 'AMOUNT', 'SAV_ACCT',
       'EMPLOYMENT', 'INSTALL_RATE', 'MaritalStatus', 'CO.APPLICANT',
       'GUARANTOR', 'PRESENT_RESIDENT', 'REAL_ESTATE', 'PROP_UNKN_NONE', 'AGE',
       'OTHER_INSTALL', 'RENT', 'OWN_RES', 'NUM_CREDITS', 'JOB',
       'NUM_DEPENDENTS', 'TELEPHONE', 'FOREIGN', 'DEFAULT'],
      dtype='object')

In [5]:
loan_df.head(5)

,OBS.,CHK_ACCT,DURATION,HISTORY,CAR,FURNITURE,RADIO.TV,EDUCATION,RETRAINING,AMOUNT,...,AGE,OTHER_INSTALL,RENT,OWN_RES,NUM_CREDITS,JOB,NUM_DEPENDENTS,TELEPHONE,FOREIGN,DEFAULT
0,1,0,6.0,4,UsedCar,0,1,0,0,1169.0,...,67.0,0,0,1,2,2,1,1,0,1
1,2,1,48.0,2,UsedCar,0,1,0,0,5951.0,...,22.0,0,0,1,1,2,1,0,0,0
2,3,3,12.0,4,UsedCar,0,0,1,0,2096.0,...,49.0,0,0,1,1,1,2,0,0,1
3,4,0,42.0,2,UsedCar,1,0,0,0,7882.0,...,45.0,0,0,0,1,2,2,0,0,1
4,5,0,24.0,3,NewCar,0,0,0,0,4870.0,...,53.0,0,0,0,2,2,2,0,0,0

In [6]:
loan_df.describe()

,OBS.,CHK_ACCT,DURATION,HISTORY,FURNITURE,RADIO.TV,EDUCATION,RETRAINING,AMOUNT,SAV_ACCT,...,AGE,OTHER_INSTALL,RENT,OWN_RES,NUM_CREDITS,JOB,NUM_DEPENDENTS,TELEPHONE,FOREIGN,DEFAULT
count,1000.000000,1000.000000,997.000000,1000.00000,1000.000000,1000.000000,1000.000000,1000.000000,996.000000,1000.000000,...,998.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,500.500000,1.577000,20.893681,2.54500,0.181000,0.280000,0.050000,0.097000,3279.088353,1.105000,...,35.523046,0.186000,0.179000,0.713000,1.407000,1.904000,1.155000,0.404000,0.037000,0.700000
std,288.819436,1.257638,12.063783,1.08312,0.385211,0.449224,0.218054,0.296106,2825.671422,1.580023,...,11.343412,0.389301,0.383544,0.452588,0.577654,0.653614,0.362086,0.490943,0.188856,0.458487
min,1.000000,0.000000,4.000000,0.00000,0.000000,0.000000,0.000000,0.000000,250.000000,0.000000,...,19.000000,0.000000,0.000000,0.000000,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000
25%,250.750000,0.000000,12.000000,2.00000,0.000000,0.000000,0.000000,0.000000,1369.750000,0.000000,...,27.000000,0.000000,0.000000,0.000000,1.000000,2.000000,1.000000,0.000000,0.000000,0.000000
50%,500.500000,1.000000,18.000000,2.00000,0.000000,0.000000,0.000000,0.000000,2324.000000,0.000000,...,33.000000,0.000000,0.000000,1.000000,1.000000,2.000000,1.000000,0.000000,0.000000,1.000000
75%,750.250000,3.000000,24.000000,4.00000,0.000000,1.000000,0.000000,0.000000,3973.750000,2.000000,...,42.000000,0.000000,0.000000,1.000000,2.000000,2.000000,1.000000,1.000000,0.000000,1.000000
max,1000.000000,3.000000,72.000000,4.00000,1.000000,1.000000,1.000000,1.000000,18424.000000,4.000000,...,75.000000,1.000000,1.000000,1.000000,4.000000,3.000000,2.000000,1.000000,1.000000,1.000000

In [7]:
loan_df.DEFAULT.value_counts()

1    700
0    300
Name: DEFAULT, dtype: int64

## Pre-processing

In [8]:
loan_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 29 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   OBS.              1000 non-null   int64
 1   CHK_ACCT          1000 non-null   int64
 2   DURATION          997 non-null    float64
 3   HISTORY           1000 non-null   int64
 4   CAR               997 non-null    object
 5   FURNITURE         1000 non-null   int64
 6   RADIO.TV          1000 non-null   int64
 7   EDUCATION         1000 non-null   int64
 8   RETRAINING        1000 non-null   int64
 9   AMOUNT            996 non-null    float64
 10  SAV_ACCT          1000 non-null   int64
 11  EMPLOYMENT        1000 non-null   int64
 12  INSTALL_RATE      1000 non-null   int64
 13  MaritalStatus     996 non-null    object
 14  CO.APPLICANT      1000 non-null   int64
 15  GUARANTOR         1000 non-null   int64
 16  PRESENT_RESIDENT  1000 non-null   int64
 17  REAL_ESTATE       1000 non-null   int64
 18  PROP_UNKN_NONE    1000 non-null   int64
 19  AGE               998 non-null    float64
 20  OTHER_INSTALL     1000 non-null   int64
 21  RENT              1000 non-null   int64
 22  OWN_RES           1000 non-null   int64
 23  NUM_CREDITS       1000 non-null   int64
 24  JOB               1000 non-null   int64
 25  NUM_DEPENDENTS    1000 non-null   int64
 26  TELEPHONE         1000 non-null   int64
 27  FOREIGN           1000 non-null   int64
 28  DEFAULT           1000 non-null   int64
dtypes: float64(3), int64(24), object(2)
memory usage: 226.7+ KB

#### Subset the Categorical variables for analysis

In [9]:
obj_df = loan_df.select_dtypes(include=['object']).copy()

In [10]:
obj_df.shape

(1000, 2)

In [11]:
obj_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CAR            997 non-null    object
 1   MaritalStatus  996 non-null    object
dtypes: object(2)
memory usage: 15.8+ KB

In [12]:
obj_df.head()

       CAR MaritalStatus
0  UsedCar       Widower
1  UsedCar        Single
2  UsedCar        Single
3  UsedCar        Single
4   NewCar        Single

### Missing values

missing value can be replace with 
- Replace by mode (categorical data)
- Replace by median
- Replace by mean
- Replace by zero
- remove row (if less number) or remove column (if high missing value)
- Replace with gap forward

### Missing Values detection

In [13]:
# Select categorical datatypes
cat_df = loan_df.select_dtypes(include=['object']).copy()
cat_df.head(5)

       CAR MaritalStatus
0  UsedCar       Widower
1  UsedCar        Single
2  UsedCar        Single
3  UsedCar        Single
4   NewCar        Single

#### Check for missing values in these (categorical) variables

In [14]:
obj_df[obj_df.isnull().any(axis=1)]

         CAR MaritalStatus
8        NaN      divorcee
100      NaN        Single
227  UsedCar           NaN
236      NaN           NaN
257  UsedCar           NaN
296  UsedCar           NaN

### Check for missing values in these df

In [15]:
loan_df.isnull().sum()

OBS.                0
CHK_ACCT            0
DURATION            3
HISTORY             0
CAR                 3
FURNITURE           0
RADIO.TV            0
EDUCATION           0
RETRAINING          0
AMOUNT              4
SAV_ACCT            0
EMPLOYMENT          0
INSTALL_RATE        0
MaritalStatus       4
CO.APPLICANT        0
GUARANTOR           0
PRESENT_RESIDENT    0
REAL_ESTATE         0
PROP_UNKN_NONE      0
AGE                 2
OTHER_INSTALL       0
RENT                0
OWN_RES             0
NUM_CREDITS         0
JOB                 0
NUM_DEPENDENTS      0
TELEPHONE           0
FOREIGN             0
DEFAULT             0
dtype: int64

In [16]:
print(loan_df.groupby(['CAR']).size())

CAR
NewCar     232
UsedCar    765
dtype: int64

In [17]:
obj_df["CAR"].value_counts()

UsedCar    765
NewCar     232
Name: CAR, dtype: int64

- there missing three values for car, assume that missing car means no car

In [18]:
obj_df = obj_df.fillna({"CAR": "No Car"})

In [19]:
obj_df.isnull().sum()

CAR              0
MaritalStatus    4
dtype: int64

In [20]:
print(loan_df.groupby(['MaritalStatus']).size())

MaritalStatus
Married      30
Single      506
Widower     343
divorcee    117
dtype: int64

- there missing four values for MaritalStatus, assume that single

In [21]:
obj_df = obj_df.fillna({"MaritalStatus": "Single"})

In [22]:
obj_df.isnull().sum()

CAR              0
MaritalStatus    0
dtype: int64

In [23]:
loan_df.isnull().sum()

OBS.                0
CHK_ACCT            0
DURATION            3
HISTORY             0
CAR                 3
FURNITURE           0
RADIO.TV            0
EDUCATION           0
RETRAINING          0
AMOUNT              4
SAV_ACCT            0
EMPLOYMENT          0
INSTALL_RATE        0
MaritalStatus       4
CO.APPLICANT        0
GUARANTOR           0
PRESENT_RESIDENT    0
REAL_ESTATE         0
PROP_UNKN_NONE      0
AGE                 2
OTHER_INSTALL       0
RENT                0
OWN_RES             0
NUM_CREDITS         0
JOB                 0
NUM_DEPENDENTS      0
TELEPHONE           0
FOREIGN             0
DEFAULT             0
dtype: int64

#### subset numerical variables

In [24]:
df_num = loan_df.select_dtypes(include=['float64'])

In [25]:
df_num.isnull().sum()

DURATION    3
AMOUNT      4
AGE         2
dtype: int64

#### Remove Rows With Missing Values

In [26]:
df_num.shape

(1000, 3)

In [27]:
df_imputed = df_num.dropna()

In [28]:
df_imputed.shape

(991, 3)

### Impute missing values with mean values

In [29]:
#impute with zero
df_num_zero = df_num.fillna(0)

In [30]:
# Check for number of missing value
print(df_num_zero.isnull().sum())

DURATION    0
AMOUNT      0
AGE         0
dtype: int64

### Impute missing values with mean values

In [31]:
#impute with mean
df_num_mean = df_num.fillna(df_num.mean())

In [32]:
# Check for number of missing value
print(df_num_mean.isnull().sum())

DURATION    0
AMOUNT      0
AGE         0
dtype: int64

#### Impute missing values with median values

In [33]:
df_num_median = df_num.fillna(df_num.median())

In [34]:
# Check for number of missing value
print(df_num_median.isnull().sum())

DURATION    0
AMOUNT      0
AGE         0
dtype: int64

### Working with categorical varibles

In [37]:
df = pd.read_csv('./datasets/Loan_data.csv')

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 29 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   OBS.              1000 non-null   int64
 1   CHK_ACCT          1000 non-null   int64
 2   DURATION          997 non-null    float64
 3   HISTORY           1000 non-null   int64
 4   CAR               997 non-null    object
 5   FURNITURE         1000 non-null   int64
 6   RADIO.TV          1000 non-null   int64
 7   EDUCATION         1000 non-null   int64
 8   RETRAINING        1000 non-null   int64
 9   AMOUNT            996 non-null    float64
 10  SAV_ACCT          1000 non-null   int64
 11  EMPLOYMENT        1000 non-null   int64
 12  INSTALL_RATE      1000 non-null   int64
 13  MaritalStatus     996 non-null    object
 14  CO.APPLICANT      1000 non-null   int64
 15  GUARANTOR         1000 non-null   int64
 16  PRESENT_RESIDENT  1000 non-null   int64
 17  REAL_ESTATE       1000 non-null   int64
 18  PROP_UNKN_NONE    1000 non-null   int64
 19  AGE               998 non-null    float64
 20  OTHER_INSTALL     1000 non-null   int64
 21  RENT              1000 non-null   int64
 22  OWN_RES           1000 non-null   int64
 23  NUM_CREDITS       1000 non-null   int64
 24  JOB               1000 non-null   int64
 25  NUM_DEPENDENTS    1000 non-null   int64
 26  TELEPHONE         1000 non-null   int64
 27  FOREIGN           1000 non-null   int64
 28  DEFAULT           1000 non-null   int64
dtypes: float64(3), int64(24), object(2)
memory usage: 226.7+ KB

In [39]:
# Convert variable(s) to category
df[["CAR", "MaritalStatus"]] = df[["CAR", "MaritalStatus"]].astype('category')

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 29 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   OBS.              1000 non-null   int64
 1   CHK_ACCT          1000 non-null   int64
 2   DURATION          997 non-null    float64
 3   HISTORY           1000 non-null   int64
 4   CAR               997 non-null    category
 5   FURNITURE         1000 non-null   int64
 6   RADIO.TV          1000 non-null   int64
 7   EDUCATION         1000 non-null   int64
 8   RETRAINING        1000 non-null   int64
 9   AMOUNT            996 non-null    float64
 10  SAV_ACCT          1000 non-null   int64
 11  EMPLOYMENT        1000 non-null   int64
 12  INSTALL_RATE      1000 non-null   int64
 13  MaritalStatus     996 non-null    category
 14  CO.APPLICANT      1000 non-null   int64
 15  GUARANTOR         1000 non-null   int64
 16  PRESENT_RESIDENT  1000 non-null   int64
 17  REAL_ESTATE       1000 non-null   int64
 18  PROP_UNKN_NONE    1000 non-null   int64
 19  AGE               998 non-null    float64
 20  OTHER_INSTALL     1000 non-null   int64
 21  RENT              1000 non-null   int64
 22  OWN_RES           1000 non-null   int64
 23  NUM_CREDITS       1000 non-null   int64
 24  JOB               1000 non-null   int64
 25  NUM_DEPENDENTS    1000 non-null   int64
 26  TELEPHONE         1000 non-null   int64
 27  FOREIGN           1000 non-null   int64
 28  DEFAULT           1000 non-null   int64
dtypes: category(2), float64(3), int64(24)
memory usage: 213.3 KB

### Label Encoding

#### Label Encoding : pandas

In [41]:
df["CAR_cat"] = df["CAR"].cat.codes

In [42]:
print(df[["CAR","CAR_cat"]].head())

       CAR  CAR_cat
0  UsedCar        1
1  UsedCar        1
2  UsedCar        1
3  UsedCar        1
4   NewCar        0

In [43]:
df["MaritalStatus_cat"] = df["MaritalStatus"].cat.codes

In [44]:
print(df[["MaritalStatus","MaritalStatus_cat"]].tail(20))

    MaritalStatus  MaritalStatus_cat
980        Single                  1
981       Widower                  2
982        Single                  1
983        Single                  1
984       Widower                  2
985      divorcee                  3
986       Widower                  2
987        Single                  1
988        Single                  1
989        Single                  1
990        Single                  1
991       Widower                  2
992        Single                  1
993        Single                  1
994       Widower                  2
995      divorcee                  3
996        Single                  1
997        Single                  1
998        Single                  1
999       Widower                  2

#### Label Encoding : sklearn

In [45]:
from sklearn.preprocessing import LabelEncoder

lbl_encod = LabelEncoder()
obj_df["CAR_Lcode"] = lbl_encod.fit_transform(obj_df["CAR"])

In [46]:
obj_df[["CAR", "CAR_Lcode"]].head(11)

        CAR  CAR_Lcode
0   UsedCar          2
1   UsedCar          2
2   UsedCar          2
3   UsedCar          2
4    NewCar          0
5   UsedCar          2
6   UsedCar          2
7   UsedCar          2
8    No Car          1
9    NewCar          0
10   NewCar          0

#### Onehot Encoding

In [47]:
df_dummies = pd.get_dummies(df[['CAR', 'MaritalStatus']])
df_dummies.head()

,CAR_NewCar,CAR_UsedCar,MaritalStatus_Married,MaritalStatus_Single,MaritalStatus_Widower,MaritalStatus_divorcee
0,0,1,0,0,1,0
1,0,1,0,1,0,0
2,0,1,0,1,0,0
3,0,1,0,1,0,0
4,1,0,0,1,0,0

In [48]:
df_dummies.shape

(1000, 6)